<?php
$br = '<br>';

/*--------------------------------------------
 time() タイムスタンプの取得
 ------------------------------------------------*/
 print time();

 /*-----------------------------------------------------
 getdate() タイムスタンプの変換
 -------------------------------------------------------*/
 $dateArray = getdate();

 foreach($dateArray as $key => $val){
  echo "$key = $val".$br;
 }

 $date = "今日の日付： ";
 $date = $dateArray['mday'];
 echo $date.$br;

 /*-------------------------------------------------------------
 date() タイムスタンプの変換
 -------------------------------------------------------------*/
//  月、日、年
 print date("m/d/y G.i:s",time()).$br;
 print "今日は";
//  j 日を表す、F 月をテキストで表す、Y 現在の都市を表す(2024)
 print date("j of F Y, \a\\t i a",time());
?>