<?php
// 改行
$br = '<br>';

/* -------------------------------------------
ユーザー定義関数
----------------------------------------------------*/
function message($br){
  echo "これはメッセージです。".$br;
  echo "test";
}
message($br);

/*--------------------------------------------------
パラメータ
-------------------------------------------------------*/
function add($first,$second,$br){
  $res = $first + $second;
  echo "first：".$first.$br;
  echo "second：".$second.$br;
  echo $res.$br;
}
add(10,20,$br);
$x = 100;
$y = 200;
add($x,$y,$br);

/*---------------------------------------------------------
コールバック
-----------------------------------------------------------*/
function changName($num,$br){
  echo "私の名前は".$num."です。".$br;
  $num = "mao";
}
$name = "koma";
echo $name."はタママに似ています。".$br;
changName($name,$br);

/*----------------------------------------------------------
参照による呼び出し
--------------------------------------------------------------*/
function name(&$num,$br){
  echo $num.$br;
  $num = $num;
  echo $num.$br;
}

$name = "koma";
echo "タママに似ている".$name."です。".$br;
name($name,$br);
echo $name.$br;

/*-----------------------------------------------------------------
デフォルトの引数
--------------------------------------------------------------*/
function hello($kotoba="こまち",$kotoba2="まお",$br='<br>'){
  echo $kotoba ."".$kotoba2.$br;
}
hello();
hello("komakoma");
hello("tamama","maomao");
?>