<?php
  $br = '<br>';

  /*-------------------------------------
   クラスの作成
   ---------------------------------*/
  //  PHPクラスを作成
   class SayHello {
    private $br = '<br>';
    function hello(){
      echo "こんにちは".$this->br;
    }
   }
$obj = new SayHello();
var_dump(gettype($obj));
echo $br;
// hello()メソッドの出力
$obj ->hello();

$obj = new stdClass;
$obj ->name = "こま";
$obj ->age = 22;
print_r($obj);

/*-------------------------------------------------
配列からオブジェクトの変換
--------------------------------------------------*/
$arr = array("name" => "こま","age" => 22);
$obj = (object)$arr;
echo $br;
print_r($obj);

/*-------------------------------------------------------
オブジェクトから配列の変換
-------------------------------------------------------*/
$obj = new stdClass;
$obj ->name = "こま";
$obj -> age = 22;

$arr = (array)$obj;
echo $br;
print_r($arr);

/*-----------------------------------------------------------
スカラー型からオブジェクト型への変換
---------------------------------------------------------*/
$name = "こま";
$age = 22;
$hoge = 4.67;

$obj1 =(object)$name;
echo $br;
print_r($obj1);

$obj2 = (object)$age;
echo $br;
print_r($obj2);

$obj3 = (object)$hoge;
echo $br;
print_r($obj3);

/*---------------------------------------------------
関数の定義
---------------------------------------------------*/
function addtion($x,$y){
  $br = '<br>';
  echo "テスト：$x,$y".($x+$y).$br;
}

$x = 10;
$y = 20;
addtion($x,$y);

/*-----------------------------------------------------------
戻り値の型の宣言
---------------------------------------------------------*/
function hoge(int $x,int $y):int{
  $z = $x + $y;
  return $z;
}

$x = 20.5;
$y =10;

echo "テスト：".$x;
echo hoge($x,$y);
?>